#+title: [C]atext()&on_exit()
#+date: <2020-02-16 日 19:32>
#+author: lagagain
#+options: toc:nil
#+export_file_name: ../docs/[C]atext()&on_exit()
* 實際上 main 也並非真正的進入點

  #+begin_src c :tangle my_main.c
    #include <stdio.h>
    #include <stdlib.h>

    int main(void) {
      printf("Hello, World\n");
    }

    void my_entry(void) {
      printf("My Entry\n");
      exit(main());
    }

  #+end_src

  可以在編譯的時候指定進入點 =my_main=

  #+begin_src shell :results none
    gcc -o main my_main.c -Wl,-emy_entry
  #+end_src

  或是

  #+begin_src shell :results none
    gcc -o main my_main.c -e my_entry
  #+end_src

  執行
  #+begin_src shell :results output string   
    ./main
  #+end_src

  #+RESULTS:
  : My Entry
  : Hello, World

  可以透過 =--verbose= 了解詳細過程

  #+begin_src shell :results output string
    gcc -o main my_main.c -e my_entry --verbose -Wl,--verbose
  #+end_src
  
